apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_syscon.h
/********************************************************************************************
 * arch/arm/src/lpc54xx/chip/lpc54_syscon.h
 *
 *   Copyright (C) 2017 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ********************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC54XX_CHIP_LPC54_SYSCON_H
#define __ARCH_ARM_SRC_LPC54XX_CHIP_LPC54_SYSCON_H

/********************************************************************************************
 * Included Files
 ********************************************************************************************/

#include <nuttx/config.h>
#include "chip/lpc54_memorymap.h"

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/

/* Register offsets *************************************************************************/

/* Main system configuration */

#define LPC54_SYSCON_AHBMATPRIO_OFFSET         0x0010  /* AHB multilayer matrix priority control */
#define LPC54_SYSCON_SYSTCKCAL_OFFSET          0x0040  /* System tick counter calibration */
#define LPC54_SYSCON_NMISRC_OFFSET             0x0048  /* NMI source select */
#define LPC54_SYSCON_ASYNCAPBCTRL_OFFSET       0x004c  /* Asynchronous APB control */
#define LPC54_SYSCON_PIOPORCAP0_OFFSET         0x00c0  /* POR captured value of port 0 */
#define LPC54_SYSCON_PIOPORCAP1_OFFSET         0x00c4  /* POR captured value of port 1 */
#define LPC54_SYSCON_PIORESCAP0_OFFSET         0x00d0  /* Reset captured value of port 0 */
#define LPC54_SYSCON_PIORESCAP1_OFFSET         0x00d4  /* Reset captured value of port 1 */
#define LPC54_SYSCON_PRESETCTRL0_OFFSET        0x0100  /* Peripheral reset control 0 */
#define LPC54_SYSCON_PRESETCTRL1_OFFSET        0x0104  /* Peripheral reset control 1 */
#define LPC54_SYSCON_PRESETCTRL2_OFFSET        0x0108  /* Peripheral reset control 2 */
#define LPC54_SYSCON_PRESETCTRLSET0_OFFSET     0x0120  /* Set bits in PRESETCTRL0 */
#define LPC54_SYSCON_PRESETCTRLSET1_OFFSET     0x0124  /* Set bits in PRESETCTRL1 */
#define LPC54_SYSCON_PRESETCTRLSET2_OFFSET     0x0128  /* Set bits in PRESETCTRL2 */
#define LPC54_SYSCON_PRESETCTRLCLR0_OFFSET     0x0140  /* Clear bits in PRESETCTRL0 */
#define LPC54_SYSCON_PRESETCTRLCLR1_OFFSET     0x0144  /* Clear bits in PRESETCTRL1 */
#define LPC54_SYSCON_PRESETCTRLCLR2_OFFSET     0x0148  /* Clear bits in PRESETCTRL2 */
#define LPC54_SYSCON_SYSRSTSTAT_OFFSET         0x01f0  /* System reset status register */
#define LPC54_SYSCON_AHBCLKCTRL0_OFFSET        0x0200  /* AHB Clock control 0 */
#define LPC54_SYSCON_AHBCLKCTRL1_OFFSET        0x0204  /* AHB Clock control 1 */
#define LPC54_SYSCON_AHBCLKCTRL2_OFFSET        0x0208  /* AHB Clock control 2 */
#define LPC54_SYSCON_AHBCLKCTRLSET0_OFFSET     0x0220  /* Set bits in AHBCLKCTRL0 */
#define LPC54_SYSCON_AHBCLKCTRLSET1_OFFSET     0x0224  /* Set bits in AHBCLKCTRL1 */
#define LPC54_SYSCON_AHBCLKCTRLSET2_OFFSET     0x0228  /* Set bits in AHBCLKCTRL2 */
#define LPC54_SYSCON_AHBCLKCTRLCLR0_OFFSET     0x0240  /* Clear bits in AHBCLKCTRL0 */
#define LPC54_SYSCON_AHBCLKCTRLCLR1_OFFSET     0x0244  /* Clear bits in AHBCLKCTRL1 */
#define LPC54_SYSCON_AHBCLKCTRLCLR2_OFFSET     0x0248  /* Clear bits in AHBCLKCTRL2 */
#define LPC54_SYSCON_MAINCLKSELA_OFFSET        0x0280  /* Main clock source select A */
#define LPC54_SYSCON_MAINCLKSELB_OFFSET        0x0284  /* Main clock source select B */
#define LPC54_SYSCON_CLKOUTSELA_OFFSET         0x0288  /* CLKOUT clock source select */
#define LPC54_SYSCON_SYSPLLCLKSEL_OFFSET       0x0290  /* PLL clock source select */
#define LPC54_SYSCON_AUDPLLCLKSEL_OFFSET       0x0298  /* Audio PLL clock source select */
#define LPC54_SYSCON_SPIFICLKSEL_OFFSET        0x02a0  /* SPIFI clock source select */
#define LPC54_SYSCON_ADCCLKSEL_OFFSET          0x02a4  /* ADC clock source select */
#define LPC54_SYSCON_USB0CLKSEL_OFFSET         0x02a8  /* USB0 clock source select */
#define LPC54_SYSCON_USB1CLKSEL_OFFSET         0x02ac  /* USB1 clock source select */
#define LPC54_SYSCON_FCLKSEL0_OFFSET           0x02b0  /* Flexcomm Interface 0 clock source select */
#define LPC54_SYSCON_FCLKSEL1_OFFSET           0x02b4  /* Flexcomm Interface 1 clock source select */
#define LPC54_SYSCON_FCLKSEL2_OFFSET           0x02b8  /* Flexcomm Interface 2 clock source select */
#define LPC54_SYSCON_FCLKSEL3_OFFSET           0x02bc  /* Flexcomm Interface 3 clock source select */
#define LPC54_SYSCON_FCLKSEL4_OFFSET           0x02c0  /* Flexcomm Interface 4 clock source select */
#define LPC54_SYSCON_FCLKSEL5_OFFSET           0x02c4  /* Flexcomm Interface 5 clock source select */
#define LPC54_SYSCON_FCLKSEL6_OFFSET           0x02c8  /* Flexcomm Interface 6 clock source select */
#define LPC54_SYSCON_FCLKSEL7_OFFSET           0x02cc  /* Flexcomm Interface 7 clock source select */
#define LPC54_SYSCON_FCLKSEL8_OFFSET           0x02d0  /* Flexcomm Interface 8 clock source select */
#define LPC54_SYSCON_FCLKSEL9_OFFSET           0x02d4  /* Flexcomm Interface 9 clock source select */
#define LPC54_SYSCON_MCLKCLKSEL_OFFSET         0x02e0  /* MCLK clock source select */
#define LPC54_SYSCON_FRGCLKSEL_OFFSET          0x02e8  /* Fractional Rate Generator clock source select */
#define LPC54_SYSCON_DMICCLKSEL_OFFSET         0x02ec  /* Digital microphone (DMIC) subsystem clock select */
#define LPC54_SYSCON_SCTCLKSEL_OFFSET          0x02f0  /* SCTimer/PWM clock source select */
#define LPC54_SYSCON_LCDCLKSEL_OFFSET          0x02f4  /* LCD clock source select */
#define LPC54_SYSCON_SDIOCLKSEL_OFFSET         0x02f8  /* SDIO clock source select */
#define LPC54_SYSCON_SYSTICKCLKDIV_OFFSET      0x0300  /* SYSTICK clock divider */
#define LPC54_SYSCON_ARMTRCLKDIV_OFFSET        0x0304  /* ARM Trace clock divider */
#define LPC54_SYSCON_CAN0CLKDIV_OFFSET         0x0308  /* MCAN0 clock divider */
#define LPC54_SYSCON_CAN1CLKDIV_OFFSET         0x030c  /* MCAN1 clock divider */
#define LPC54_SYSCON_SC0CLKDIV_OFFSET          0x0310  /* Smartcard0 clock divider */
#define LPC54_SYSCON_SC1CLKDIV_OFFSET          0x0314  /* Smartcard1 clock divider */
#define LPC54_SYSCON_AHBCLKDIV_OFFSET          0x0380  /* System clock divider */
#define LPC54_SYSCON_CLKOUTDIV_OFFSET          0x0384  /* CLKOUT clock divider */
#define LPC54_SYSCON_FROHFDIV_OFFSET           0x0388  /* FROHF clock divider */
#define LPC54_SYSCON_SPIFICLKDIV_OFFSET        0x0390  /* SPIFI clock divider */
#define LPC54_SYSCON_ADCCLKDIV_OFFSET          0x0394  /* ADC clock divider */
#define LPC54_SYSCON_USB0CLKDIV_OFFSET         0x0398  /* USB0 clock divider */
#define LPC54_SYSCON_USB1CLKDIV_OFFSET         0x039c  /* USB1 clock divider */
#define LPC54_SYSCON_FRGCTRL_OFFSET            0x03a0  /* Fractional rate divider */
#define LPC54_SYSCON_DMICCLKDIV_OFFSET         0x03a8  /* DMIC clock divider */
#define LPC54_SYSCON_MCLKDIV_OFFSET            0x03ac  /* I2S MCLK clock divider */
#define LPC54_SYSCON_LCDCLKDIV_OFFSET          0x03b0  /* LCD clock divider */
#define LPC54_SYSCON_SCTCLKDIV_OFFSET          0x03b4  /* SCT/PWM clock divider */
#define LPC54_SYSCON_EMCCLKDIV_OFFSET          0x03b8  /* EMC clock divider */
#define LPC54_SYSCON_SDIOCLKDIV_OFFSET         0x03bc  /* SDIO clock divider */
#define LPC54_SYSCON_FLASHCFG_OFFSET           0x0400  /* Flash wait states configuration */
#define LPC54_SYSCON_USB0CLKCTRL_OFFSET        0x040c  /* USB0 clock control */
#define LPC54_SYSCON_USB0CLKSTAT_OFFSET        0x0410  /* USB0 clock status */
#define LPC54_SYSCON_FREQMECTRL_OFFSET         0x0418  /* Frequency measure register */
#define LPC54_SYSCON_MCLKIO_OFFSET             0x0420  /* MCLK input/output control */
#define LPC54_SYSCON_USB1CLKCTRL_OFFSET        0x0424  /* USB1 clock control */
#define LPC54_SYSCON_USB1CLKSTAT_OFFSET        0x0428  /* USB1 clock status */
#define LPC54_SYSCON_EMCSYSCTRL_OFFSET         0x0444  /* EMC system control */
#define LPC54_SYSCON_EMCDLYCTRL_OFFSET         0x0448  /* EMC clock delay control */
#define LPC54_SYSCON_EMCDLYCAL_OFFSET          0x044c  /* EMC delay chain calibration control */
#define LPC54_SYSCON_ETHPHYSEL_OFFSET          0x0450  /* Ethernet PHY selection */
#define LPC54_SYSCON_ETHSBDCTRL_OFFSET         0x0454  /* Ethernet SBD flow control */
#define LPC54_SYSCON_SDIOCLKCTRL_OFFSET        0x0460  /* SDIO CCLKIN phase and delay control */
#define LPC54_SYSCON_FROCTRL_OFFSET            0x0500  /* FRO oscillator control */
#define LPC54_SYSCON_SYSOSCCTRL_OFFSET         0x0504  /* System oscillator control */
#define LPC54_SYSCON_WDTOSCCTRL_OFFSET         0x0508  /* Watchdog oscillator control */
#define LPC54_SYSCON_RTCOSCCTRL_OFFSET         0x050c  /* RTC oscillator 32 kHz output control */
#define LPC54_SYSCON_USBPLLCTRL_OFFSET         0x051c  /* USB PLL control */
#define LPC54_SYSCON_USBPLLSTAT_OFFSET         0x0520  /* USB PLL status */
#define LPC54_SYSCON_SYSPLLCTRL_OFFSET         0x0580  /* System PLL control */
#define LPC54_SYSCON_SYSPLLSTAT_OFFSET         0x0584  /* PLL status */
#define LPC54_SYSCON_SYSPLLNDEC_OFFSET         0x0588  /* PLL N divider */
#define LPC54_SYSCON_SYSPLLPDEC_OFFSET         0x058c  /* PLL P divider */
#define LPC54_SYSCON_SYSPLLMDEC_OFFSET         0x0590  /* System PLL M divider */
#define LPC54_SYSCON_AUDPLLCTRL_OFFSET         0x05a0  /* Audio PLL control */
#define LPC54_SYSCON_AUDPLLSTAT_OFFSET         0x05a4  /* Audio PLL status */
#define LPC54_SYSCON_AUDPLLNDEC_OFFSET         0x05a8  /* Audio PLL N divider */
#define LPC54_SYSCON_AUDPLLPDEC_OFFSET         0x05ac  /* Audio PLL P divider */
#define LPC54_SYSCON_AUDPLLMDEC_OFFSET         0x05b0  /* Audio PLL M divider */
#define LPC54_SYSCON_AUDPLLFRAC_OFFSET         0x05b4  /* Audio PLL fractional divider control */
#define LPC54_SYSCON_PDSLEEPCFG0_OFFSET        0x0600  /* Sleep configuration register 0 */
#define LPC54_SYSCON_PDSLEEPCFG1_OFFSET        0x0604  /* Sleep configuration register 1 */
#define LPC54_SYSCON_PDRUNCFG0_OFFSET          0x0610  /* Power configuration register 0 */
#define LPC54_SYSCON_PDRUNCFG1_OFFSET          0x0614  /* Power configuration register 1 */
#define LPC54_SYSCON_PDRUNCFGSET0_OFFSET       0x0620  /* Set bits in PDRUNCFG0 */
#define LPC54_SYSCON_PDRUNCFGSET1_OFFSET       0x0624  /* Set bits in PDRUNCFG1 */
#define LPC54_SYSCON_PDRUNCFGCLR0_OFFSET       0x0630  /* Clear bits in PDRUNCFG0 */
#define LPC54_SYSCON_PDRUNCFGCLR1_OFFSET       0x0634  /* Clear bits in PDRUNCFG1 */
#define LPC54_SYSCON_STARTER0_OFFSET           0x0680  /* Start logic 0 wake-up enable register */
#define LPC54_SYSCON_STARTER1_OFFSET           0x0684  /* Start logic 1 wake-up enable register */
#define LPC54_SYSCON_STARTERSET0_OFFSET        0x06a0  /* Set bits in STARTER0 */
#define LPC54_SYSCON_STARTERSET1_OFFSET        0x06a4  /* Set bits in STARTER1 */
#define LPC54_SYSCON_STARTERCLR0_OFFSET        0x06c0  /* Clear bits in STARTER0 */
#define LPC54_SYSCON_STARTERCLR1_OFFSET        0x06c4  /* Clear bits in STARTER1 */
#define LPC54_SYSCON_HWWAKE_OFFSET             0x0780  /* Configures special cases of hardware wake-up */
#define LPC54_SYSCON_AUTOCGOR_OFFSET           0x0e04  /* Auto clock-gate override */
#define LPC54_SYSCON_JTAGIDCODE_OFFSET         0x0ff4  /* JTAG ID code */
#define LPC54_SYSCON_DEVICE_ID0_OFFSET         0x0ff8  /* Part ID */
#define LPC54_SYSCON_DEVICE_ID1_OFFSET         0x0ffc  /* Boot ROM and die revision */

/* Asynchronous system configuration */

