apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_syscon.h
/* Register bit definitions *****************************************************************/

/* Main system configuration */

/* AHB multilayer matrix priority control */
#define SYSCON_AHBMATPRIO_
/* System tick counter calibration */
#define SYSCON_SYSTCKCAL_
/* NMI source select */
#define SYSCON_NMISRC_
/* Asynchronous APB control */
#define SYSCON_ASYNCAPBCTRL_
/* POR captured value of port 0 */
#define SYSCON_PIOPORCAP0_
/* POR captured value of port 1 */
#define SYSCON_PIOPORCAP1_
/* Reset captured value of port 0 */
#define SYSCON_PIORESCAP0_
/* Reset captured value of port 1 */
#define SYSCON_PIORESCAP1_

/* Peripheral reset control 0: PRESETCTRL0, PRESETCTRLSET0, and PRESETCTRLCLR0 */

#define SYSCON_PRESETCTRL0_FLASH               (1 << 7)  /* Bit 7:  Reset the flash controller */
#define SYSCON_PRESETCTRL0_FMC                 (1 << 8)  /* Bit 8:  Reset the Flash accelerator */
#define SYSCON_PRESETCTRL0_EEPROM              (1 << 9)  /* Bit 9:  Reset EEPROM */
#define SYSCON_PRESETCTRL0_SPIFI               (1 << 10) /* Bit 10: Reset the SPIFI */
#define SYSCON_PRESETCTRL0_INPUTMUX            (1 << 11) /* Bit 11: Reset the input muxes */
#define SYSCON_PRESETCTRL0_IOCON               (1 << 13) /* Bit 13: Reset the IOCON block */
#define SYSCON_PRESETCTRL0_GPIO0               (1 << 14) /* Bit 14: Reset the GPIO0 port registers */
#define SYSCON_PRESETCTRL0_GPIO1               (1 << 15) /* Bit 15: Reset the GPIO1 port registers */
#define SYSCON_PRESETCTRL0_GPIO2               (1 << 16) /* Bit 16: Reset the GPIO2 port registers */
#define SYSCON_PRESETCTRL0_GPIO3               (1 << 17) /* Bit 17: Reset the GPIO3 port registers */
#define SYSCON_PRESETCTRL0_PINT                (1 << 18) /* Bit 18: Reset the pin interrupt block */
#define SYSCON_PRESETCTRL0_GINT                (1 << 19) /* Bit 19: Reset the grouped pin interrupt block */
#define SYSCON_PRESETCTRL0_DMA                 (1 << 20) /* Bit 20: Reset the DMA controller */
#define SYSCON_PRESETCTRL0_CRC                 (1 << 21) /* Bit 21: Reset the CRC engine */
#define SYSCON_PRESETCTRL0_WWDT                (1 << 22) /* Bit 22: Reset the Watchdog Timer */
#define SYSCON_PRESETCTRL0_RTC                 (1 << 23) /* Bit 23: Enables the bus clock for the RTC */
#define SYSCON_PRESETCTRL0_ADC0                (1 << 27) /* Bit 27: Reset the ADC0 register interface */

/* Peripheral reset control 2: PRESETCTRL1, PRESETCTRLSET1, and PRESETCTRLCLR1 */

#define SYSCON_PRESETCTRL1_MRT                 (1 << 0)  /* Bit 0:  Reset the Multi-Rate Timer */
#define SYSCON_PRESETCTRL1_SCT0                (1 << 2)  /* Bit 2:  Reset SCT0 */
#define SYSCON_PRESETCTRL1_MCAN0               (1 << 7)  /* Bit 7:  Reset MCAN0 */
#define SYSCON_PRESETCTRL1_MCAN1               (1 << 8)  /* Bit 8:  Reset MCAN1 */
#define SYSCON_PRESETCTRL1_UTICK               (1 << 10) /* Bit 10: Reset the Micro-tick Timer */
#define SYSCON_PRESETCTRL1_FLEXCOMM0           (1 << 11) /* Bit 11: Reset Flexcomm Interface 0 */
#define SYSCON_PRESETCTRL1_FLEXCOMM1           (1 << 12) /* Bit 12: Reset Flexcomm Interface 1 */
#define SYSCON_PRESETCTRL1_FLEXCOMM2           (1 << 13) /* Bit 13: Reset Flexcomm Interface 2 */
#define SYSCON_PRESETCTRL1_FLEXCOMM3           (1 << 14) /* Bit 14: Reset Flexcomm Interface 3 */
#define SYSCON_PRESETCTRL1_FLEXCOMM4           (1 << 15) /* Bit 15: Reset Flexcomm Interface 4 */
#define SYSCON_PRESETCTRL1_FLEXCOMM5           (1 << 16) /* Bit 16: Reset Flexcomm Interface 5 */
#define SYSCON_PRESETCTRL1_FLEXCOMM6           (1 << 17) /* Bit 17: Reset Flexcomm Interface 6 */
#define SYSCON_PRESETCTRL1_FLEXCOMM7           (1 << 18) /* Bit 18: Reset Flexcomm Interface 7 */
#define SYSCON_PRESETCTRL1_DMIC                (1 << 19) /* Bit 19: Reset the digital microphone interface */
#define SYSCON_PRESETCTRL1_CTIMER2             (1 << 22) /* Bit 22: Reset CTIMER 2 */
#define SYSCON_PRESETCTRL1_USB0D               (1 << 25) /* Bit 25: Reset the USB0 device interface */
#define SYSCON_PRESETCTRL1_CTIMER0             (1 << 26) /* Bit 26: Reset timer CTIMER0 */
#define SYSCON_PRESETCTRL1_CTIMER1             (1 << 27) /* Bit 27: Reset timer CTIMER1 */

/* Peripheral reset control 2: PRESETCTRL2, PRESETCTRL2, and PRESETCTRLCLR2 */

#define SYSCON_PRESETCTRL2_LCD                 (1 << 2)  /* Bit 2:  Reset the LCD interface */
#define SYSCON_PRESETCTRL2_SDIO                (1 << 3)  /* Bit 3:  Reset the SDIO interface */
#define SYSCON_PRESETCTRL2_USB1H               (1 << 4)  /* Bit 4:  Reset the USB1 host interface */
#define SYSCON_PRESETCTRL2_USB1D               (1 << 5)  /* Bit 5:  Reset the USB1 device interface */
#define SYSCON_PRESETCTRL2_USB1RAM             (1 << 6)  /* Bit 6:  Reset the USB1 RAM interface */
#define SYSCON_PRESETCTRL2_EMC                 (1 << 7)  /* Bit 7:  Reset the EMC interface */
#define SYSCON_PRESETCTRL2_ETH                 (1 << 8)  /* Bit 8:  Reset the ethernet interface */
#define SYSCON_PRESETCTRL2_GPIO4               (1 << 9)  /* Bit 9:  Reset the GPIO4 interface */
#define SYSCON_PRESETCTRL2_GPIO5               (1 << 10) /* Bit 10: Reset the GPIO5 interface */
#define SYSCON_PRESETCTRL2_OTP                 (1 << 12) /* Bit 12: Reset the OTP interface */
#define SYSCON_PRESETCTRL2_RNG                 (1 << 13) /* Bit 13: Reset the RNG interface */
#define SYSCON_PRESETCTRL2_FLEXCOMM8           (1 << 14) /* Bit 14: Reset the Flexcomm Interface 8 */
#define SYSCON_PRESETCTRL2_FLEXCOMM9           (1 << 15) /* Bit 15: Reset the Flexcomm Interface 9 */
#define SYSCON_PRESETCTRL2_USB0HMR             (1 << 16) /* Bit 16: Reset the USB host master interface */
#define SYSCON_PRESETCTRL2_USB0HSL             (1 << 17) /* Bit 17: Reset the USB host slave interface */
#define SYSCON_PRESETCTRL2_SHA                 (1 << 18) /* Bit 18: Reset the SHA interface */
#define SYSCON_PRESETCTRL2_SC0                 (1 << 19) /* Bit 19: Reset the Smart card0 interface */
#define SYSCON_PRESETCTRL2_SC1                 (1 << 20) /* Bit 20: Reset the Smart card1 interface */

/* System reset status register */
#define SYSCON_SYSRSTSTAT_

/* AHB Clock control 0: AHBCLKCTRL0, AHBCLKCTRLCLR0, and AHBCLKCTRLSET0 */

#define SYSCON_AHBCLKCTRL0_ROM                 (1 << 1)  /* Bit 1:  Enables the clock for the Boot ROM */
#define SYSCON_AHBCLKCTRL0_SRAM1               (1 << 3)  /* Bit 3:  Enables the clock for SRAM1 */
#define SYSCON_AHBCLKCTRL0_SRAM2               (1 << 4)  /* Bit 4:  Enables the clock for SRAM2 */
#define SYSCON_AHBCLKCTRL0_SRAM3               (1 << 5)  /* Bit 5:  Enables the clock for SRAM3 */
#define SYSCON_AHBCLKCTRL0_FLASH               (1 << 7)  /* Bit 7:  Enables the clock for the flash controller */
#define SYSCON_AHBCLKCTRL0_FMC                 (1 << 8)  /* Bit 8:  Enables the clock for the Flash accelerator */
#define SYSCON_AHBCLKCTRL0_EEPROM              (1 << 9)  /* Bit 9:  Enables the clock for EEPROM */
#define SYSCON_AHBCLKCTRL0_SPIFI               (1 << 10) /* Bit 10: Enables the clock for the SPIFI */
#define SYSCON_AHBCLKCTRL0_INPUTMUX            (1 << 11) /* Bit 11: Enables the clock for the input muxes */
#define SYSCON_AHBCLKCTRL0_IOCON               (1 << 13) /* Bit 13: Enables the clock for the IOCON block */
#define SYSCON_AHBCLKCTRL0_GPIO0               (1 << 14) /* Bit 14: Enables the clock for the GPIO0 port registers */
#define SYSCON_AHBCLKCTRL0_GPIO1               (1 << 15) /* Bit 15: Enables the clock for the GPIO1 port registers */
#define SYSCON_AHBCLKCTRL0_GPIO2               (1 << 16) /* Bit 16: Enables the clock for the GPIO2 port registers */
#define SYSCON_AHBCLKCTRL0_GPIO3               (1 << 17) /* Bit 17: Enables the clock for the GPIO3 port registers */
#define SYSCON_AHBCLKCTRL0_PINT                (1 << 18) /* Bit 18: Enables the clock for the pin interrupt block */
#define SYSCON_AHBCLKCTRL0_GINT                (1 << 19) /* Bit 19: Enables the clock for the grouped pin interrupt block */
#define SYSCON_AHBCLKCTRL0_DMA                 (1 << 20) /* Bit 20: Enables the clock for the DMA controller */
#define SYSCON_AHBCLKCTRL0_CRC                 (1 << 21) /* Bit 21: Enables the clock for the CRC engine */
#define SYSCON_AHBCLKCTRL0_WWDT                (1 << 22) /* Bit 22: Enables the clock for the Watchdog Timer */
#define SYSCON_AHBCLKCTRL0_RTC                 (1 << 23) /* Bit 23: Enables the bus clock for the RTC */
#define SYSCON_AHBCLKCTRL0_ADC0                (1 << 27) /* Bit 27: Enables the clock for the ADC0 register interface */

/* AHB Clock control 1: AHBCLKCTRL1, AHBCLKCTRLCLR1, and AHBCLKCTRLSET1 */

#define SYSCON_AHBCLKCTRL1_MRT                 (1 << 0)  /* Bit 0:  Enables the clock for the Multi-Rate Timer */
#define SYSCON_AHBCLKCTRL1_RIT                 (1 << 1)  /* Bit 1:  Enables the clock for the Repetitive Interrupt Timer */
#define SYSCON_AHBCLKCTRL1_SCT0                (1 << 2)  /* Bit 2:  Enables the clock for SCT0 */
#define SYSCON_AHBCLKCTRL1_MCAN0               (1 << 7)  /* Bit 7:  Enables the clock for MCAN0 */
#define SYSCON_AHBCLKCTRL1_MCAN1               (1 << 8)  /* Bit 8:  Enables the clock for MCAN1 */
#define SYSCON_AHBCLKCTRL1_UTICK               (1 << 10) /* Bit 10: Enables the clock for the Micro-tick Timer */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM0           (1 << 11) /* Bit 11: Enables the clock for Flexcomm Interface 0 */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM1           (1 << 12) /* Bit 12: Enables the clock for Flexcomm Interface 1 */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM2           (1 << 13) /* Bit 13: Enables the clock for Flexcomm Interface 2 */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM3           (1 << 14) /* Bit 14: Enables the clock for Flexcomm Interface 3 */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM4           (1 << 15) /* Bit 15: Enables the clock for Flexcomm Interface 4 */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM5           (1 << 16) /* Bit 16: Enables the clock for Flexcomm Interface 5 */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM6           (1 << 17) /* Bit 17: Enables the clock for Flexcomm Interface 6 */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM7           (1 << 18) /* Bit 18: Enables the clock for Flexcomm Interface 7 */
#define SYSCON_AHBCLKCTRL1_DMIC                (1 << 19) /* Bit 19: Enables the clock for the digital microphone interface */
#define SYSCON_AHBCLKCTRL1_CTIMER2             (1 << 22) /* Bit 22: Enables the clock for CTIMER 2 */
#define SYSCON_AHBCLKCTRL1_USB0D               (1 << 25) /* Bit 25: Enables the clock for the USB0 device interface */
#define SYSCON_AHBCLKCTRL1_CTIMER0             (1 << 26) /* Bit 26: Enables the clock for timer CTIMER0 */
#define SYSCON_AHBCLKCTRL1_CTIMER1             (1 << 27) /* Bit 27: Enables the clock for timer CTIMER1 */

