apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_syscon.h
/* AHB Clock control 2: AHBCLKCTRL2, AHBCLKCTRLCLR2, and AHBCLKCTRLSET2 */

#define SYSCON_AHBCLKCTRL2_LCD                 (1 << 2)  /* Bit 2:  Enables the clock for the LCD interface */
#define SYSCON_AHBCLKCTRL2_SDIO                (1 << 3)  /* Bit 3:  Enables the clock for the SDIO interface */
#define SYSCON_AHBCLKCTRL2_USB1H               (1 << 4)  /* Bit 4:  Enables the clock for the USB1 host interface */
#define SYSCON_AHBCLKCTRL2_USB1D               (1 << 5)  /* Bit 5:  Enables the clock for the USB1 device interface */
#define SYSCON_AHBCLKCTRL2_USB1RAM             (1 << 6)  /* Bit 6:  Enables the clock for the USB1 RAM interface */
#define SYSCON_AHBCLKCTRL2_EMC                 (1 << 7)  /* Bit 7:  Enables the clock for the EMC interface */
#define SYSCON_AHBCLKCTRL2_ETH                 (1 << 8)  /* Bit 8:  Enables the clock for the ethernet interface */
#define SYSCON_AHBCLKCTRL2_GPIO4               (1 << 9)  /* Bit 9:  Enables the clock for the GPIO4 interface */
#define SYSCON_AHBCLKCTRL2_GPIO5               (1 << 10) /* Bit 10: Enables the clock for the GPIO5 interface */
#define SYSCON_AHBCLKCTRL2_OTP                 (1 << 12) /* Bit 12: Enables the clock for the OTP interface */
#define SYSCON_AHBCLKCTRL2_RNG                 (1 << 13) /* Bit 13: Enables the clock for the RNG interface */
#define SYSCON_AHBCLKCTRL2_FLEXCOMM8           (1 << 14) /* Bit 14: Enables the clock for the Flexcomm Interface 8 */
#define SYSCON_AHBCLKCTRL2_FLEXCOMM9           (1 << 15) /* Bit 15: Enables the clock for the Flexcomm Interface 9 */
#define SYSCON_AHBCLKCTRL2_USB0HMR             (1 << 16) /* Bit 16: Enables the clock for the USB host master interface */
#define SYSCON_AHBCLKCTRL2_USB0HSL             (1 << 17) /* Bit 17: Enables the clock for the USB host slave interface */
#define SYSCON_AHBCLKCTRL2_SHA                 (1 << 18) /* Bit 18: Enables the clock for the SHA interface */
#define SYSCON_AHBCLKCTRL2_SC0                 (1 << 19) /* Bit 19: Enables the clock for the Smart card0 interface */
#define SYSCON_AHBCLKCTRL2_SC1                 (1 << 20) /* Bit 20: Enables the clock for the Smart card1 interface */

/* Main clock source select A */

#define SYSCON_MAINCLKSELA_SHIFT               (0)       /* Bits 0-1:  Clock source for main clock */
#define SYSCON_MAINCLKSELA_MASK                (3 << SYSCON_MAINCLKSELA_SHIFT)
#  define SYSCON_MAINCLKSELA_FRO12             (0 << SYSCON_MAINCLKSELA_SHIFT) /* FRO 12 MHz (fro_12m) */
#  define SYSCON_MAINCLKSELA_CLKIN             (1 << SYSCON_MAINCLKSELA_SHIFT) /* CLKIN (clk_in) */
#  define SYSCON_MAINCLKSELA_WDTCLK            (2 << SYSCON_MAINCLKSELA_SHIFT) /* Watchdog oscillator (wdt_clk) */
#  define SYSCON_MAINCLKSELA_FROHF             (3 << SYSCON_MAINCLKSELA_SHIFT) /* FRO 96 or 48 MHz (fro_hf) */

/* Main clock source select B */

#define SYSCON_MAINCLKSELB_SHIFT               (0)       /* Bits 0-1: Clock source for main clock */
#define SYSCON_MAINCLKSELB_MASK                (3 << SYSCON_MAINCLKSELB_SHIFT)
#  define SYSCON_MAINCLKSELB_MAINCLKSELA       (0 << SYSCON_MAINCLKSELB_SHIFT) /* Use MAINCLKSELA selection */
#  define SYSCON_MAINCLKSELB_PLLCLK            (2 << SYSCON_MAINCLKSELB_SHIFT) /* System PLL output (pll_clk) */
#  define SYSCON_MAINCLKSELB_32KCLK            (3 << SYSCON_MAINCLKSELB_SHIFT) /* RTC oscillator 32 kHz output (32k_clk) */

/* CLKOUT clock source select */
#define SYSCON_CLKOUTSELA_

/* PLL clock source select */

#define SYSCON_SYSPLLCLKSEL_SHIFT              (0)       /* Bits 0-2: System PLL clock source selection */
#define SYSCON_SYSPLLCLKSEL_MASK               (7 << SYSCON_SYSPLLCLKSEL_SHIFT)
#  define SYSCON_SYSPLLCLKSEL_FFRO             (0 << SYSCON_SYSPLLCLKSEL_SHIFT) /* FRO 12 MHz (fro_12m) */
#  define SYSCON_SYSPLLCLKSEL_CLKIN            (1 << SYSCON_SYSPLLCLKSEL_SHIFT) /* CLKIN (clk_in) */
#  define SYSCON_SYSPLLCLKSEL_RTC              (3 << SYSCON_SYSPLLCLKSEL_SHIFT) /* RTC oscillator 32 KHz ouput */
#  define SYSCON_SYSPLLCLKSEL_NONE             (7 << SYSCON_SYSPLLCLKSEL_SHIFT) /* None */

/* Audio PLL clock source select */
#define SYSCON_AUDPLLCLKSEL_
/* SPIFI clock source select */
#define SYSCON_SPIFICLKSEL_
/* ADC clock source select */
#define SYSCON_ADCCLKSEL_
/* USB0 clock source select */
#define SYSCON_USB0CLKSEL_
/* USB1 clock source select */
#define SYSCON_USB1CLKSEL_

/* Flexcomm Interface 0..9 clock source select */

#define SYSCON_FCLKSEL_SHIFT                   (0)     /* Bits 0-2: Flexcomm Interface clock source selection */
#define SYSCON_FCLKSEL_MASK                    (7 << SYSCON_FCLKSEL_SHIFT)
#  define SYSCON_FCLKSEL_FRO12M                (0 << SYSCON_FCLKSEL_SHIFT) /* FRO 12 MHz (fro_12m) */
#  define SYSCON_FCLKSEL_FROHFDIV              (1 << SYSCON_FCLKSEL_SHIFT) /* FRO 96 or 48 MHz divided (fro_hf_div) */
#  define SYSCON_FCLKSEL_AUDPLLCLK             (2 << SYSCON_FCLKSEL_SHIFT) /* Audio PLL clock (audio_pll_clk) */
#  define SYSCON_FCLKSEL_MCLK                  (3 << SYSCON_FCLKSEL_SHIFT) /* MCK */
#  define SYSCON_FCLKSEL_FRG                   (4 << SYSCON_FCLKSEL_SHIFT) /* FRG clock */
#  define SYSCON_FCLKSEL_NONE                  (7 << SYSCON_FCLKSEL_SHIFT) /* None */

/* MCLK clock source select */

#define SYSCON_MCLKCLKSEL_SHIFT                (0)     /* Bits 0-2: MCLK source select */
#define SYSCON_MCLKCLKSEL_MASK                 (7 << SYSCON_MCLKCLKSEL_SHIFT)
#  define SYSCON_MCLKCLKSEL_FROHFDIV           (0 << SYSCON_MCLKCLKSEL_SHIFT) /* FRO 96 or 48 MHz divided (fro_hf_div) */
#  define SYSCON_MCLKCLKSEL_AUDPLLCLK          (1 << SYSCON_MCLKCLKSEL_SHIFT) /* Audio PLL clock (audio_pll_clk) */
#  define SYSCON_MCLKCLKSEL_NONE               (7 << SYSCON_MCLKCLKSEL_SHIFT) /* None */

/* Fractional Rate Generator clock source select */

#define SYSCON_FRGCLKSEL_SHIFT                 (0)       /* Bits 0-2: Fractional Rate Generator clock source */
#define SYSCON_FRGCLKSEL_MASK                  (7 << SYSCON_FRGCLKSEL_SHIFT)
#  define SYSCON_FRGCLKSEL_MAINCLK             (0 << SYSCON_FRGCLKSEL_SHIFT) /* Main clock (main_clk) */
#  define SYSCON_FRGCLKSEL_PLLCLK              (1 << SYSCON_FRGCLKSEL_SHIFT) /* System PLL output (pll_clk) */
#  define SYSCON_FRGCLKSEL_FRO12M              (2 << SYSCON_FRGCLKSEL_SHIFT) /* FRO 12 MHz (fro_12m) */
#  define SYSCON_FRGCLKSEL_FROHF               (3 << SYSCON_FRGCLKSEL_SHIFT) /* FRO 96 or 48 MHz (fro_hf) */
#  define SYSCON_FRGCLKSEL_NONE                (7 << SYSCON_FRGCLKSEL_SHIFT) /* None */

/* Digital microphone (DMIC) subsystem clock select */
#define SYSCON_DMICCLKSEL_
/* SCTimer/PWM clock source select */
#define SYSCON_SCTCLKSEL_

/* LCD clock source select */

#define SYSCON_LCDCLKSEL_SHIFT                 (0)       /* Bits 0-1: LCD clock source select */
#define SYSCON_LCDCLKSEL_MASK                  (3 << SYSCON_LCDCLKSEL_SHIFT)
#  define SYSCON_LCDCLKSEL_MAINCLK             (0 << SYSCON_LCDCLKSEL_SHIFT) /* Main clock (main_clk) */
#  define SYSCON_LCDCLKSEL_LCDCLKIN            (1 << SYSCON_LCDCLKSEL_SHIFT) /* LCD external clock input (LCD_CLKIN) */
#  define SYSCON_LCDCLKSEL_FROHF               (2 << SYSCON_LCDCLKSEL_SHIFT) /* FRO 96 or 48 MHz (fro_hf) */
#  define SYSCON_LCDCLKSEL_NONE                (3 << SYSCON_LCDCLKSEL_SHIFT) /* None */

/* SDIO clock source select */
#define SYSCON_SDIOCLKSEL_

/* SYSTICK clock divider */

