apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_syscon.h
#define SYSCON_SYSTICKCLKDIV_DIV_SHIFT         (0)       /* Bits 0-7: Clock divider value */
#define SYSCON_SYSTICKCLKDIV_DIV_MASK          (0xff << SYSCON_SYSTICKCLKDIV_DIV_SHIFT)
#  define SYSCON_SYSTICKCLKDIV_DIV(n)          ((uint32_t)((n)-1) << SYSCON_SYSTICKCLKDIV_DIV_SHIFT)
#define SYSCON_SYSTICKCLKDIV_RESET             (1 << 29) /* Bit 29: Resets the divider counter */
#define SYSCON_SYSTICKCLKDIV_HALT              (1 << 30) /* Bit 30: Halts the divider counter */
#define SYSCON_SYSTICKCLKDIV_REQFLAG           (1 << 31) /* Bit 31: Divider status flag */

/* ARM Trace clock divider */
#define SYSCON_ARMTRCLKDIV_
/* MCAN0 clock divider */
#define SYSCON_CAN0CLKDIV_
/* MCAN1 clock divider */
#define SYSCON_CAN1CLKDIV_
/* Smartcard0 clock divider */
#define SYSCON_SC0CLKDIV_
/* Smartcard1 clock divider */
#define SYSCON_SC1CLKDIV_
/* System clock divider */

#define SYSCON_AHBCLKDIV_DIV_SHIFT             (0)       /* Bits 0-7: Clock divider value */
#define SYSCON_AHBCLKDIV_DIV_MASK              (0xff << SYSCON_AHBCLKDIV_DIV_SHIFT)
#  define SYSCON_AHBCLKDIV_DIV(n)              ((uint32_t)((n)-1) << SYSCON_AHBCLKDIV_DIV_SHIFT)
#define SYSCON_AHBCLKDIV_REQFLAG               (1 << 31) /* Bit 32: Divider status flag */

/* CLKOUT clock divider */
#define SYSCON_CLKOUTDIV_
/* FROHF clock divider */
#define SYSCON_FROHFDIV_
/* SPIFI clock divider */
#define SYSCON_SPIFICLKDIV_
/* ADC clock divider */
#define SYSCON_ADCCLKDIV_
/* USB0 clock divider */
#define SYSCON_USB0CLKDIV_
/* USB1 clock divider */
#define SYSCON_USB1CLKDIV_

/* Fractional rate divider */

#define SYSCON_FRGCTRL_DIV_SHIFT               (0)       /*  Bits 0-7: Denominator of the fractional divider */
#define SYSCON_FRGCTRL_DIV_MASK                (0xff << SYSCON_FRGCTRL_DIV_SHIFT)
#  define SYSCON_FRGCTRL_DIV(n)                ((uint32_t)((n)-1) << SYSCON_FRGCTRL_DIV_SHIFT)
#define SYSCON_FRGCTRL_MULT_SHIFT              (8)       /* Bit 8-15: Numerator of the fractional divider */
#define SYSCON_FRGCTRL_MULT_MASK               (0xff << SYSCON_FRGCTRL_MULT_SHIFT)
#  define SYSCON_FRGCTRL_MULT(n)               ((uint32_t)(n) << SYSCON_FRGCTRL_MULT_SHIFT)

/* DMIC clock divider */
#define SYSCON_DMICCLKDIV_
/* I2S MCLK clock divider */
#define SYSCON_MCLKDIV_

/* LCD clock divider */

#define SYSCON_LCDCLKDIV_DIV_SHIFT             (0)       /* Bits 0-7: Clock divider value */
#define SYSCON_LCDCLKDIV_DIV_MASK              (0xff <<SYSCON_LCDCLKDIV_DIV_SHIFT)
#  define SYSCON_LCDCLKDIV_DIV(n)              ((uint32_t)((n)-1) << SYSCON_LCDCLKDIV_DIV_SHIFT)
#define SYSCON_LCDCLKDIV_RESET                 (1 << 29) /* Bit 29: Resets the divider counter */
#define SYSCON_LCDCLKDIV_HALT                  (1 << 30) /* Bit 30: Halts the divider counter */
#define SYSCON_LCDCLKDIV_REQFLAG               (1 << 31) /* Bit 31: Divider status flag */

/* SCT/PWM clock divider */
#define SYSCON_SCTCLKDIV_

/* EMC clock divider */

#define SYSCON_EMCCLKDIV_DIV_SHIFT             (0)       /* Bits 0-7: Clock divider value */
#define SYSCON_EMCCLKDIV_DIV_MASK              (0xff <<SYSCON_EMCCLKDIV_DIV_SHIFT)
#  define SYSCON_EMCCLKDIV_DIV(n)              ((uint32_t)((n)-1) << SYSCON_EMCCLKDIV_DIV_SHIFT)
#define SYSCON_EMCCLKDIV_RESET                 (1 << 29) /* Bit 29: Resets the divider counter */
#define SYSCON_EMCCLKDIV_HALT                  (1 << 30) /* Bit 30: Halts the divider counter */
#define SYSCON_EMCCLKDIV_REQFLAG               (1 << 31) /* Bit 31: Divider status flag */

/* SDIO clock divider */
#define SYSCON_SDIOCLKDIV_

/* Flash wait states configuration */

#define SYSCON_FLASHCFG_FETCHCFG_SHIFT         (0)       /* Bits 0-1: Instruction fetch configuration */
#define SYSCON_FLASHCFG_FETCHCFG_MASK          (3 << SYSCON_FLASHCFG_FETCHCFG_SHIFT)
#  define SYSCON_FLASHCFG_FETCHCFG_NONE        (0 << SYSCON_FLASHCFG_FETCHCFG_SHIFT) /* Instruction fetches not buffered */
#  define SYSCON_FLASHCFG_FETCHCFG_ONE         (1 << SYSCON_FLASHCFG_FETCHCFG_SHIFT) /* One buffer used for instruction fetches */
#  define SYSCON_FLASHCFG_FETCHCFG_ALL         (2 << SYSCON_FLASHCFG_FETCHCFG_SHIFT) /*  All buffers used for instruction fetches */
#define SYSCON_FLASHCFG_DATACFG_SHIFT          (2)       /* Bit 2-3: Data read configuration */
#define SYSCON_FLASHCFG_DATACFG_MASK           (3 << SYSCON_FLASHCFG_DATACFG_SHIFT)
#  define SYSCON_FLASHCFG_DATACFG_NONE         (0 << SYSCON_FLASHCFG_DATACFG_SHIFT) /* Data accesses from flash not buffered */
#  define SYSCON_FLASHCFG_DATACFG_ONE          (1 << SYSCON_FLASHCFG_DATACFG_SHIFT) /* One buffer used for data accesses */
#  define SYSCON_FLASHCFG_DATACFG_ALL          (2 << SYSCON_FLASHCFG_DATACFG_SHIFT) /*  All buffers used for data accesses */
#define SYSCON_FLASHCFG_ACCEL                  (1 << 4)  /* Bit 4:  Acceleration enable */
#define SYSCON_FLASHCFG_PREFEN                 (1 << 5)  /* Bit 5:  Prefetch enable */
#define SYSCON_FLASHCFG_PREFOVR                (1 << 6)  /* Bit 6:  Prefetch override */
#define SYSCON_FLASHCFG_FLASHTIM_SHIFT         (12)      /* Bits 12-15: Flash memory access time */
#define SYSCON_FLASHCFG_FLASHTIM_MASK          (15 << SYSCON_FLASHCFG_FLASHTIM_SHIFT)
#  define SYSCON_FLASHCFG_FLASHTIM(n)          ((uint32_t)((n)-1) << SYSCON_FLASHCFG_FLASHTIM_SHIFT)

/* USB0 clock control */
#define SYSCON_USB0CLKCTRL_
/* USB0 clock status */
#define SYSCON_USB0CLKSTAT_
/* Frequency measure register */
#define SYSCON_FREQMECTRL_
/* MCLK input/output control */
#define SYSCON_MCLKIO_
/* USB1 clock control */
#define SYSCON_USB1CLKCTRL_
/* USB1 clock status */
#define SYSCON_USB1CLKSTAT_

/* EMC system control */

#define SYSCON_EMCSYSCTRL_SC                   (1 << 0)  /* Bit 0:  EMC Shift Control */
#define SYSCON_EMCSYSCTRL_RD                   (1 << 1)  /* Bit 1:  EMC Reset Disable */
#define SYSCON_EMCSYSCTRL_BC                   (1 << 2)  /* Bit 2:  External Memory Controller burst control */
#define SYSCON_EMCSYSCTRL_FBCLKINSEL           (1 << 3)  /* Bit 3:  External Memory Controller clock select */

/* EMC clock delay control */
#define SYSCON_EMCDLYCTRL_
/* EMC delay chain calibration control */
#define SYSCON_EMCDLYCAL_
/* Ethernet PHY selection */
#define SYSCON_ETHPHYSEL_
/* Ethernet SBD flow control */
#define SYSCON_ETHSBDCTRL_
/* SDIO CCLKIN phase and delay control */
#define SYSCON_SDIOCLKCTRL_
/* FRO oscillator control */
#define SYSCON_FROCTRL_
/* System oscillator control */
#define SYSCON_SYSOSCCTRL_
/* Watchdog oscillator control */
#define SYSCON_WDTOSCCTRL_
/* RTC oscillator 32 kHz output control */
#define SYSCON_RTCOSCCTRL_
/* USB PLL control */
#define SYSCON_USBPLLCTRL_
/* USB PLL status */
#define SYSCON_USBPLLSTAT_

/* System PLL control */

#define SYSCON_SYSPLLCTRL_SELR_SHIFT           (0)       /* Bits 0-3: Bandwidth select R value */
#define SYSCON_SYSPLLCTRL_SELR_MASK            (15 << SYSCON_SYSPLLCTRL_SELR_SHIFT)
#  define SYSCON_SYSPLLCTRL_SELR(n)            ((uint32_t)(n) << SYSCON_SYSPLLCTRL_SELR_SHIFT)
#define SYSCON_SYSPLLCTRL_SELI_SHIFT           (4)       /* Bits 4-9: Bandwidth select I value */
#define SYSCON_SYSPLLCTRL_SELI_MASK            (0x3f << SYSCON_SYSPLLCTRL_SELI_SHIFT)
#  define SYSCON_SYSPLLCTRL_SELI(n)            ((uint32_t)(n) << SYSCON_SYSPLLCTRL_SELI_SHIFT)
#define SYSCON_SYSPLLCTRL_SELP_SHIFT           (10)      /* Bits 10-14: Bandwidth select P value */
#define SYSCON_SYSPLLCTRL_SELP_MASK            (0x1f << SYSCON_SYSPLLCTRL_SELP_SHIFT)
#  define SYSCON_SYSPLLCTRL_SELP(n)            ((uint32_t)(n) << SYSCON_SYSPLLCTRL_SELP_SHIFT)
#define SYSCON_SYSPLLCTRL_BYPASS               (1 << 15) /* Bit 15: PLL bypass control */
#define SYSCON_SYSPLLCTRL_UPLIMOFF             (1 << 17) /* Bit 17: Disable upper frequency limiter */
#define SYSCON_SYSPLLCTRL_DIRECTI              (1 << 19) /* Bit 19: PLL direct input enable */
#define SYSCON_SYSPLLCTRL_DIRECTO              (1 << 10) /* Bit 20: PLL direct output enable */

/* PLL status */

#define SYSCON_SYSPLLSTAT_LOCK                 (1 << 0)  /* Bit 0:   LOCK PLL lock indicator */

/* PLL N divider */

