apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_syscon.h
#define SYSCON_SYSPLLNDEC_NDEC_SHIFT           (0)       /* Bits 0-9: Decoded N-divider coefficient */
#define SYSCON_SYSPLLNDEC_NDEC_MASK            (0x3ff << SYSCON_SYSPLLNDEC_NDEC_SHIFT)
#  define SYSCON_SYSPLLNDEC_NDEC(n)            ((uint32_t)(n) << SYSCON_SYSPLLNDEC_NDEC_SHIFT)
#define SYSCON_SYSPLLNDEC_NREQ                 (1 << 10) /* Bit 10:  NDEC reload request */

/* PLL P divider */

#define SYSCON_SYSPLLPDEC_PDEC_SHIFT           (0)       /* Bits 0-6: Decoded P-divider coefficient */
#define SYSCON_SYSPLLPDEC_PDEC_MASK            (0x7f << SYSCON_SYSPLLPDEC_PDEC_SHIFT)
#  define SYSCON_SYSPLLPDEC_PDEC(n)            ((uint32_t)(n) << SYSCON_SYSPLLPDEC_PDEC_SHIFT)
#define SYSCON_SYSPLLPDEC_PREQ                 (1 << 7)  /* Bit 7:  PDEC reload request */

/* System PLL M divider */

#define SYSCON_SYSPLLMDEC_MDEC_SHIFT           (0)       /* Bits 0-16: Decoded M-divider coefficient */
#define SYSCON_SYSPLLMDEC_MDEC_MASK            (0xffff << SYSCON_SYSPLLMDEC_MDEC_SHIFT)
#  define SYSCON_SYSPLLMDEC_MDEC(n)            ((uint32_t)(n) << SYSCON_SYSPLLMDEC_MDEC_SHIFT)
#define SYSCON_SYSPLLMDEC_MREQ                 (1 << 17) /* Bit 17:  MDEC reload request */

/* Audio PLL control */
#define SYSCON_AUDPLLCTRL_
/* Audio PLL status */
#define SYSCON_AUDPLLSTAT_
/* Audio PLL N divider */
#define SYSCON_AUDPLLNDEC_
/* Audio PLL P divider */
#define SYSCON_AUDPLLPDEC_
/* Audio PLL M divider */
#define SYSCON_AUDPLLMDEC_
/* Audio PLL fractional divider control */
#define SYSCON_AUDPLLFRAC_
/* Sleep configuration register 0 */
#define SYSCON_PDSLEEPCFG0_
/* Sleep configuration register 1 */
#define SYSCON_PDSLEEPCFG1_

/* Power configuration register 0 (also corresponding set/clear registers) */

#define SYSCON_PDRUNCFG0_FRO                   (1 << 4)  /* Bit 4:  FRO oscillator */
#define SYSCON_PDRUNCFG0_TS                    (1 << 6)  /* Bit 6:  Temp sensor */
#define SYSCON_PDRUNCFG0_BODRST                (1 << 7)  /* Bit 7:  Brown-out Detect reset */
#define SYSCON_PDRUNCFG0_BODINTR               (1 << 8)  /* Bit 8:  Brown-out Detect interrupt */
#define SYSCON_PDRUNCFG0_VD2ANA                (1 << 9)  /* Bit 9:  Analog supply for System Oscillator */
#define SYSCON_PDRUNCFG0_ADC0                  (1 << 10) /* Bit 10: ADC power */
#define SYSCON_PDRUNCFG0_SRAMX                 (1 << 13) /* Bit 13: Controls SRAMX */
#define SYSCON_PDRUNCFG0_SRAM0                 (1 << 14) /* Bit 14: Controls SRAM0 */
#define SYSCON_PDRUNCFG0_SRAM123               (1 << 15) /* Bit 15: Controls SRAM1, SRAM2, and SRAM3 */
#define SYSCON_PDRUNCFG0_USBRAM                (1 << 16) /* Bit 16: Controls USB_RAM */
#define SYSCON_PDRUNCFG0_VDDA                  (1 << 19) /* Bit 19: VDDA to the ADC */
#define SYSCON_PDRUNCFG0_WDTOSC                (1 << 20) /* Bit 20: Watchdog oscillator */
#define SYSCON_PDRUNCFG0_USB0PHY               (1 << 21) /* Bit 21: USB0 PHY power */
#define SYSCON_PDRUNCFG0_SYSPLL                (1 << 22) /* Bit 22: System PLL power */
#define SYSCON_PDRUNCFG0_VREFP                 (1 << 23) /* Bit 23: VREFP to the ADC  */
#define SYSCON_PDRUNCFG0_VD3                   (1 << 26) /* Bit 26: Power control for all PLLs */
#define SYSCON_PDRUNCFG0_VD4                   (1 << 27) /* Bit 27: Power control for all SRAMs and ROM */
#define SYSCON_PDRUNCFG0_VD5                   (1 << 28) /* Bit 28: Power control both USB0 PHY and USB1 PHY */
#define SYSCON_PDRUNCFG0_VD6                   (1 << 29) /* Bit 29  Power control for EEPROM */

/* Power configuration register 1  (also corresponding set/clear registers)*/

#define SYSCON_PDRUNCFG1_USB1PHY               (1 << 0)  /* Bit 0:  USB1 high speed PHY */
#define SYSCON_PDRUNCFG1_USB1PLL               (1 << 1)  /* Bit 1:  USB PLL power */
#define SYSCON_PDRUNCFG1_AUDPLL                (1 << 2)  /* Bit 2:  Audio PLL power and fractional divider */
#define SYSCON_PDRUNCFG1_SYSOSC                (1 << 3)  /* Bit 3:  System Oscillator Power */
#define SYSCON_PDRUNCFG1_EEPROM                (1 << 5)  /* Bit 5:  EEPROM power */
#define SYSCON_PDRUNCFG1_RNG                   (1 << 7)  /* Bit 7:  Random Number Generator Power */

/* Start logic 0 wake-up enable register */
#define SYSCON_STARTER0_
/* Start logic 1 wake-up enable register */
#define SYSCON_STARTER1_
/* Set bits in STARTER0 */
#define SYSCON_STARTERSET0_
/* Set bits in STARTER1 */
#define SYSCON_STARTERSET1_
/* Clear bits in STARTER0 */
#define SYSCON_STARTERCLR0_
/* Clear bits in STARTER1 */
#define SYSCON_STARTERCLR1_
/* Configures special cases of hardware wake-up */
#define SYSCON_HWWAKE_
/* Auto clock-gate override */
#define SYSCON_AUTOCGOR_
/* JTAG ID code */
#define SYSCON_JTAGIDCODE_
/* Part ID */
#define SYSCON_DEVICE_ID0_
/* Boot ROM and die revision */
#define SYSCON_DEVICE_ID1_

/* Asynchronous system configuration */

/* Async peripheral reset control, set, and clear registers */

#define SYSCON_ASYNCPRESET_CTIMER3             (1 << 13) /* Bit 13:  CTIMER3 reset control */
#define SYSCON_ASYNCPRESET_CTIMER4             (1 << 14) /* Bit 14:  CTIMER4 reset control */

/* Async peripheral clock control, set and clear registers */

#define SYSCON_ASYNCAPBCLKCTRL_CTIMER3         (1 << 13) /* Bit 13:  CTIMER3 clock control */
#define SYSCON_ASYNCAPBCLKCTRL_CTIMER4         (1 << 14) /* Bit 14:  CTIMER4 clock control */

/* Async APB clock source select A */
#define SYSCON_ASYNCAPBCLKSELA_

/* Other system configuration */

/* Brown-Out Detect control */
#define SYSCON_BODCTRL_

#endif /* __ARCH_ARM_SRC_LPC54XX_CHIP_LPC54_SYSCON_H */
